# Data Inconsistencies:

Data inconsistencies refer to discrepancies, errors, or irregularities in a dataset that deviate from the expected standards or patterns.

1. **Inconsistent Format**:
   - Occurs when data in a column is represented in different formats. For example, a 'date' column may contain various date formats. Standardizing the format ensures uniformity across the column.

2. **Inconsistent Naming Convention**:
   - Arises when data in a column follows different naming conventions. For instance, a 'country' column may have entries like USA, U.S.A, United States, United States of America. Standardizing the naming convention brings consistency to the data.

3. **Typographical Errors**:
   - Result from mistakes made during data entry, leading to inconsistencies in the data. For instance, a misspelled country name like "Paakistan" instead of "Pakistan" introduces typographical errors.

4. **Duplication**:
   - Occurs when identical or highly similar entries are present multiple times in the dataset. Removing duplicates ensures data integrity and avoids redundancy.

5. **Contradictory**:
   - Arises when data entries conflict with each other or violate logical constraints. For example, if there are columns for 'father_age' and 'son_age', it's logically expected that the son's age should be less than the father's age. Identifying and resolving such contradictions is crucial for data quality.

In [61]:
import pandas as pd

In [62]:
data={
    'date':['2021-12-01','01-12-2022','2022/02/01','12-01-2021'],
    'country':["USA","U.S.A","America","United States"],
    'name':['John Doe','John Doe','Jon doe','Jonn Doe'],
    'sales_2023':[100,200,None,200],
    'sales_2024':[None,150,300,200]
}

df=pd.DataFrame(data)

In [63]:
df.head()

         date        country      name  sales_2023  sales_2024
0  2021-12-01            USA  John Doe       100.0         NaN
1  01-12-2022          U.S.A  John Doe       200.0       150.0
2  2022/02/01        America   Jon doe         NaN       300.0
3  12-01-2021  United States  Jonn Doe       200.0       200.0

### Standardizing the date format

In [64]:
df['date'] = pd.to_datetime(df['date'], errors='coerce').dt.strftime('%Y-%m-%d')

In [65]:
df.head()

         date        country      name  sales_2023  sales_2024
0  2021-12-01            USA  John Doe       100.0         NaN
1         NaN          U.S.A  John Doe       200.0       150.0
2         NaN        America   Jon doe         NaN       300.0
3         NaN  United States  Jonn Doe       200.0       200.0

We can impute missing `dates` with placeholder vaulues.

In [66]:
import pandas as pd

# Sample data with different date formats and missing values
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/02/01', '12-01-2021', 'Dec 1, 2021', '2021.12.01', None, '2022-03-15', '2021-abc-01'],
    'country': ["USA", "U.S.A", "America", "United States", "Canada", "Mexico", "France", "Germany", "Spain"],
}

df = pd.DataFrame(data)

# Step 1: Identify missing or invalid dates
invalid_dates = df['date'].isin(['', None])  # Filter missing values
df['invalid_dates'] = invalid_dates  # Add a flag column to identify invalid dates

# Step 2: Impute missing or invalid dates
df.loc[invalid_dates, 'date'] = '1900-01-01'  # Replace missing or invalid dates with a placeholder value

# Step 3: Convert dates to a consistent format using custom parsing methods
df['date'] = pd.to_datetime(df['date'], errors='coerce', format='%Y-%m-%d')

# Display the DataFrame to verify the changes
print(df)

        date        country  invalid_dates
0 2021-12-01            USA          False
1        NaT          U.S.A          False
2        NaT        America          False
3        NaT  United States          False
4        NaT         Canada          False
5        NaT         Mexico          False
6 1900-01-01         France           True
7 2022-03-15        Germany          False
8        NaT          Spain          False

In [67]:
df['date'].fillna('1900-01-01', inplace=True)

C:\Users\MC\AppData\Local\Temp\ipykernel_8144\2244997730.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['date'].fillna('1900-01-01', inplace=True)

In [68]:
df.head()

        date        country  invalid_dates
0 2021-12-01            USA          False
1 1900-01-01          U.S.A          False
2 1900-01-01        America          False
3 1900-01-01  United States          False
4 1900-01-01         Canada          False

`naT` values are imputed by place holder values

# Harmonize the name of the country

In [69]:
country_mapping={'USA':"United States",'U.S.A':"United States",'USA':"United States","America":"United States","Canada":"United States"}
df['country']=df['country'].replace(country_mapping)

In [70]:
df.head()

        date        country  invalid_dates
0 2021-12-01  United States          False
1 1900-01-01  United States          False
2 1900-01-01  United States          False
3 1900-01-01  United States          False
4 1900-01-01  United States          False

# correct the typo graphical mistakes in name

In [79]:
data={
    'date':['2021-12-01','01-12-2022','2022/02/01','12-01-2021'],
    'country':["USA","U.S.A","America","United States"],
    'name':['Jon Doe','Jon Doe','Jon doe','Jonn Doe'],
    'sales_2023':[100,200,500,150],
    'sales_2024':[None,150,300,200]
}

df=pd.DataFrame(data)

In [80]:
df.head()

         date        country      name  sales_2023  sales_2024
0  2021-12-01            USA   Jon Doe         100         NaN
1  01-12-2022          U.S.A   Jon Doe         200       150.0
2  2022/02/01        America   Jon doe         500       300.0
3  12-01-2021  United States  Jonn Doe         150       200.0

In [81]:
df['name']=df['name'].replace({"Jon Doe":"John Doe"})

In [82]:
df.head()

         date        country      name  sales_2023  sales_2024
0  2021-12-01            USA  John Doe         100         NaN
1  01-12-2022          U.S.A  John Doe         200       150.0
2  2022/02/01        America   Jon doe         500       300.0
3  12-01-2021  United States  Jonn Doe         150       200.0

# remove duplicates

In [83]:
df.drop_duplicates(subset='name')

         date        country      name  sales_2023  sales_2024
0  2021-12-01            USA  John Doe         100         NaN
2  2022/02/01        America   Jon doe         500       300.0
3  12-01-2021  United States  Jonn Doe         150       200.0

### Resolving contradictory data
### For demonstration, let's assume sales_2023 should always be higher than sales_2024
### We'll remove rows where this condition is not meeting

In [84]:
df=df.drop(df[df['sales_2023']<=df['sales_2024']].index)

In [85]:
df.head()

         date  country      name  sales_2023  sales_2024
0  2021-12-01      USA  John Doe         100         NaN
1  01-12-2022    U.S.A  John Doe         200       150.0
2  2022/02/01  America   Jon doe         500       300.0